Revit 2027 API
AnalysisDisplayStyle.GetDeformedShapeSettings Method
 Get deformed shape settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayDeformedShapeSettings GetDeformedShapeSettings()
Public Function GetDeformedShapeSettings As AnalysisDisplayDeformedShapeSettings
public:
AnalysisDisplayDeformedShapeSettings^ GetDeformedShapeSettings()
member GetDeformedShapeSettings : unit -> AnalysisDisplayDeformedShapeSettings
Return Value
AnalysisDisplayDeformedShapeSettings
Exceptions
Exception | Condition
InvalidOperationException |  deformed shape settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace